Repository: kandrakah/Cardinal.AspNetCore
Catalog: Core/Cardinal.AspNetCore.Identity/Localization/Resource.*.resx
Languages: pt_br

# AUTHORIZATION_ADDING_USER_DETAILS
source: Updating user data with the authority
pt_br: Atualizando os dados do usuário com a autoridade

# AUTHORIZATION_ANNONYMOUS
source: Request for access to the anonymous access endpoint {path} by Ip {ip}
pt_br: Solicitação de acesso ao endpoint de acesso anônimo {path} por Ip {ip}

# AUTHORIZATION_ERROR_INVALID_TOKEN
source: Invalid access token: [{status}: {message}]
pt_br: Token de acesso inválido: [{status}] {mensagem}

# AUTHORIZATION_ERROR_TOKEN_WRONG_FORMAT
source: Invalid access token: Wrong format!
pt_br: Token de acesso inválido: formato errado!

# AUTHORIZATION_ERROR_UPDATE_SYSTEM_USER
source: Failed to update system user: {msg}
pt_br: Falha ao atualizar usuário do sistema: {msg}

# AUTHORIZATION_PROTECTED
source: Request for access to the protected access endpoint {path} received from {ip}
pt_br: Solicitação de acesso ao endpoint de acesso protegido {path} recebida de {ip}

# AUTHORIZATION_USER_AUTHORIZED
source: The user {usr} is authorized to access the {path} endpoint.
pt_br: O usuário {usr} está autorizado a acessar o endpoint {path}.

# AUTHORIZATION_USER_ISROOT
source: The user has master access!
pt_br: O usuário tem acesso mestre!

# AUTHORIZATION_USER_UNHAUTHORIZED
source: Unauthorized user!
pt_br: Usuário não autorizado!

# AUTHORIZATION_VALIDATIND_TOKEN
source: Validating access token
pt_br: Validando token de acesso

# ERROR_AUTHORIZATION_SERVICE_NOT_REGISTERED
source: Authorization service not found. This service is essential for the operation of the permission system. Register an authorization service using the 'AddAuthorizationService' extension of 'IServicesCollection' in the 'Startup' class or disable the service by setting 'DeactivePermissionService' to False in 'Authority' in your settings file.
pt_br: Serviço de autorização não localizado. Este serviço é essencial para o funcionamento do sistema de permissões. Registre um serviço de autorização utilizando a extensão 'AddAuthorizationService' de 'IServicesCollection' na classe 'Startup' ou desative o serviço definindo 'DeactivePermissionService' como False em 'Authority' em seu arquivo de configurações.

# ERROR_CERTIFICATE_FAIL
source: Failed to get the certificate
pt_br: Falha ao obter o certificado

# ERROR_CERTIFICATE_NOT_FOUND
source: The certificate has not found
pt_br: O certificado não foi localizado

# ERROR_GET_USERINFO
source: Could not retrieve user profile data: [{status}] {message}
pt_br: Não foi possível obter os dados do perfil do usuário: [{status}]{message}

# ERROR_PERMISSION_DEFAULT_METHOD_REQUIRED
source: The default permission must declare the execution method!
pt_br: A permissão padrão deve declarar o método de execução!

# ERROR_PERMISSION_MISSING
source: Permission denied!
pt_br: Permissão negada!

# ERROR_PERMISSION_MISSING_MULTI_LOGGER
source: The user {usr} does not have one of the required permissions for this service: {pems}
pt_br: O usuário {usr} não tem uma das permissões necessárias para este serviço: {pems}

# ERROR_PERMISSION_MISSING_SINGLE_LOGGER
source: The user {usr} does not have any of the necessary permissions to access this service. At least one permission is required: {pem}
pt_br: O usuário {usr} não possui nenhuma das permissões necessárias para acessar este serviço. É necessária pelo menos uma permissão: {pem}

# PERMISSION_DEFAULT_DESCRIPTION
source: Service default controller permission.
pt_br: Permissão de controlador padrão do serviço.

# PERMISSION_DEFAULT_DESCRIPTION_WITH_NAME
source: Default permission for $[CONTROLLER_NAME].
pt_br: Permissão padrão para $[CONTROLLER_NAME].

# PERMISSION_DEFAULT_NAME
source: Default
pt_br: Padrão

# PERMISSION_ROOT_DESCRIPTION
source: Higher level permission allowing unrestricted access to all functions of the service.
pt_br: Permissão de nível mais alto permitindo acesso irrestrito à todas as funções do serviço.

# PERMISSION_ROOT_NAME
source: Administrator
pt_br: Administrador

# TOKEN_VALIDATION_VALID
source: The token is valid!
pt_br: O token é válido!
